                                                             
                                                              
  
                                         
                                                       
                                                                
  
                                      
                                                             


class Helper(object):
    HELP_ABOUT = '''
**➻ ᴛʜɪs ɪs <u>{0}</u>
─────────────────────────
❖ ᴧ ϻᴜsɪᴄ ʙσᴛ ғσʀ ᴛєʟєɢʀᴧϻ ɢʀσᴜᴘs / ᴄʜᴧηηєʟs
─────────────────────────
● ᴡʀɪᴛᴛєη ɪη ➥ [ᴩʏᴛʜση](https://www.python.org/)
● ᴅᴧᴛᴧʙᴧsє ➥ [ϻᴏηɢᴏ-ᴅʙ](https://www.mongodb.com/)
● ʜєʟᴘ ᴡɪᴛʜ [ᴘʏʀᴏɢʀᴧϻ](https://github.com/pyrogram/pyrogram) & [ᴘʏ-ᴛɢᴄᴧʟʟs](https://github.com/pytgcalls/pytgcalls).
─────────────────────────
✦ ηᴏ ʟᴀɢ • ηᴏ ᴧᴅs • ηᴏ ʙᴜɢs • 24/7 sᴜᴘᴘᴏʀᴛ
✦ ᴇηᴊᴏʏ ʟᴧɢ ғʀєє ϻᴜsɪᴄ • ᴧᴅᴅ ϻє ηᴏᴡ
─────────────────────────
» ᴘʀɪᴠᴧᴛє & sєᴄυʀє sσᴜʀᴄє | ηᴏ ᴅᴧᴛᴧ sʜᴧʀᴇ
» ʟɪᴄєηᴄєᴅ ᴜsє | ʏσυтυʙє ᴀᴘɪ sυᴘᴘσʀтєᴅ 
──────────────────────
➤ ʙσᴛ sᴛᴧᴛυs & ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/TeamAnanyaBots)
➤ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση :- [ᴄσηᴛᴧᴄᴛ ʜєʀє](https://t.me/WTF_NoFilter)
─────────────────────────**
'''
    
    HELP_SUPPORT = '''
**❖ <u>{0}</u> sᴜᴘᴘᴏʀᴛ ɪηғσ :-

● 24/7 ᴧᴠᴧɪʟᴧʙʟє ғσʀ ᴧηʏ ʙσᴛ.
● ᴋᴇᴇᴘ ᴄʜᴧᴛ ᴄʟєᴧη ᴧηᴅ ʙᴜɢ-ғʀєє.
● ᴧηʏ ᴘʀσʙʟєϻ ? ᴊᴜsᴛ ᴄσηᴛᴧᴄᴛ ᴜs.
─────────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [˹ ᴛᴇᴀᴍ ᴀɴᴀɴʏᴀ ʙᴏᴛs˼](https://t.me/TeamAnanyaBots)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [˹ ᴀɴᴀɴʏᴀ ꜱᴜᴩᴩᴏʀᴛ˼](https://t.me/AnanyaSupportChat)
❖ ɢɪᴛ ʜᴜʙ ʟɪηᴋ ➥ [ᴢᴏxxᴏᴩ](https://github.com/ZoxxOP)
─────────────────────────**
'''


    HELP_WEL = '''**<u>❖ ʜєʟᴘ ғσʀ ᴡᴇʟᴄᴏᴍᴇ :</u>

❍ /welcome : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ʙᴜᴛᴛᴏɴ ғᴏʀ ᴡᴇʟᴄᴏᴍᴇ.**

<i>» ɴᴏᴛᴇ :- ᴡᴇʟᴄᴏᴍᴇ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ɪɴ 5 ᴍɪɴᴜᴛᴇs.</i>
'''

    HELP_NIGHT = '''**<u>❖ ʜєʟᴘ ғσʀ ɴɪɢʜᴛ ᴍᴏᴅᴇ ❖</u>

❍ /nightmode : ɪɴʟɪɴᴇ ᴄᴏɴᴛʀᴏʟs ʙᴜᴛᴛᴏɴ ғᴏʀ ɴɪɢʜᴛ ᴍᴏᴅᴇ.

❖ 𝐂ʀᴇᴅɪᴛ 𝖡ʏ » [˹ ᴛᴇᴀᴍ ᴀɴᴀɴʏᴀ ʙᴏᴛs˼](https://t.me/TeamAnanyaBots)**
'''


    HELP_LOCK = '''
**<u>❖ ʜєʀє ɪs ʜєʟᴘ ғσʀ ʟᴏᴄᴋs :</u>

🔒 ᴀᴅᴠᴀɴᴄᴇᴅ ʟᴏᴄᴋ sʏsᴛᴇᴍ — ꜰᴜʟʟ ᴄᴏɴᴛʀᴏʟ

• /lock [type] — ᴇɴᴀʙʟᴇ ᴀɴʏ ʟᴏᴄᴋ ᴛʏᴘᴇ  
• /unlock [type] — ᴅɪsᴀʙʟᴇ sᴘᴇᴄɪꜰɪᴄ ʟᴏᴄᴋ  
• /unlockall — ʀᴇᴍᴏᴠᴇ ᴀʟʟ ʟᴏᴄᴋs  
• /locks — ᴏᴘᴇɴ ɪɴʟɪɴᴇ ʟᴏᴄᴋ ᴍᴇɴᴜ
• /lockadmin [on/off] — ʟᴏᴄᴋ ᴀᴘᴘʟɪᴇs ᴛᴏ ᴀᴅᴍɪɴs ᴀʟsᴏ  
• /locktypes — ᴠɪᴇᴡ ᴀʟʟ ʟᴏᴄᴋ ᴛʏᴘᴇs ᴡɪᴛʜ ᴅᴇsᴄʀɪᴘᴛɪᴏɴs  

<i>⚡ ᴘᴇʀᴍɪssɪᴏɴ ʀᴇǫᴜɪʀᴇᴅ : ᴄᴀɴ_ᴄʜᴀɴɢᴇ_ɪɴꜰᴏ</i>

🟢 ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀ sʏsᴛᴇᴍ — ʙʏᴘᴀss ᴍᴏᴅᴇ

• /approve — ᴀᴘᴘʀᴏᴠᴇ ᴀ ᴜsᴇʀ (ʟᴏᴄᴋs ᴡɪʟʟ ɴᴏᴛ ᴀꜰꜰᴇᴄᴛ ᴛʜᴇᴍ)  
• /unapprove — ʀᴇᴍᴏᴠᴇ ᴀᴘᴘʀᴏᴠᴀʟ  
• /approvedusers — sʜᴏᴡ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs  
• /allunapprove — ʀᴇᴍᴏᴠᴇ ᴀʟʟ ᴀᴘᴘʀᴏᴠᴇᴅ ᴜsᴇʀs  

<i>⚡ ᴏɴʟʏ ɢʀᴏᴜᴘ ᴀᴅᴍɪɴs ᴄᴀɴ ᴀᴘᴘʀᴏᴠᴇ/ᴜɴᴀᴘᴘʀᴏᴠᴇ</i>

⚠️ ᴀᴜᴛᴏ ᴡᴀʀɴ sʏsᴛᴇᴍ

• /lockwarns — ᴄʜᴇᴄᴋ ᴀ ᴜsᴇʀ's ʟᴏᴄᴋ ᴡᴀʀɴɪɴɢs  
• /clearwarns — ᴄʟᴇᴀʀ ᴀʟʟ ᴡᴀʀɴɪɴɢs ᴏꜰ ᴀ ᴜsᴇʀ  

🔸 3 ᴡᴀʀɴɪɴɢs = ᴀᴜᴛᴏ ʙᴀɴ  
🔸 ᴀᴅᴅɪɴɢ ʙᴏᴛs ᴡʜᴇɴ ʟᴏᴄᴋᴇᴅ = ᴀᴜᴛᴏ ᴡᴀʀɴ + ᴀᴜᴛᴏ ʀᴇᴍᴏᴠᴇ + ᴀᴜᴛᴏ ʙᴀɴ (ɪꜰ ʀᴇᴘᴇᴀᴛᴇᴅ)
  ❖ 𝐂ʀᴇᴅɪᴛ 𝖡ʏ » [˹ ᴛᴇᴀᴍ ᴀɴᴀɴʏᴀ ʙᴏᴛs˼](https://t.me/TeamAnanyaBots)**
'''

                                                             
                                                              
  
                                    
                                                 
                                      
                                                             
